raw-results/azure/azure-direct-100rps.txt
Running 1m test @ https://sabc-claude-sea.cognitiveservices.azure.com/openai/deployments/gpt-5/chat/completions?api-version=2025-01-01-preview
  4 threads and 100 connections
  Thread calibration: mean lat.: 3225.443ms, rate sampling interval: 9486ms
  Thread calibration: mean lat.: 3140.774ms, rate sampling interval: 9543ms
  Thread calibration: mean lat.: 3199.888ms, rate sampling interval: 10297ms
  Thread calibration: mean lat.: 3009.553ms, rate sampling interval: 9134ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    10.97s     5.37s   22.81s    65.32%
    Req/Sec    23.26     16.39    63.00     84.21%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%   11.72s 
 75.000%   15.27s 
 90.000%   17.53s 
 99.000%   20.07s 
 99.900%   21.99s 
 99.990%   22.36s 
 99.999%   22.82s 
100.000%   22.82s 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

      43.487     0.000000            1         1.00
    2693.119     0.100000          517         1.11
    6201.343     0.200000         1034         1.25
    8273.919     0.300000         1549         1.43
   10002.431     0.400000         2066         1.67
   11722.751     0.500000         2581         2.00
   12460.031     0.550000         2842         2.22
   13139.967     0.600000         3098         2.50
   13869.055     0.650000         3358         2.86
   14540.799     0.700000         3615         3.33
   15269.887     0.750000         3872         4.00
   15622.143     0.775000         4000         4.44
   15990.783     0.800000         4129         5.00
   16326.655     0.825000         4258         5.71
   16752.639     0.850000         4387         6.67
   17104.895     0.875000         4519         8.00
   17301.503     0.887500         4583         8.89
   17530.879     0.900000         4648        10.00
   17760.255     0.912500         4710        11.43
   17973.247     0.925000         4779        13.33
   18169.855     0.937500         4842        16.00
   18300.927     0.943750         4873        17.78
   18415.615     0.950000         4904        20.00
   18628.607     0.956250         4936        22.86
   18759.679     0.962500         4969        26.67
   18939.903     0.968750         5000        32.00
   19038.207     0.971875         5018        35.56
   19152.895     0.975000         5033        40.00
   19283.967     0.978125         5050        45.71
   19447.807     0.981250         5066        53.33
   19677.183     0.984375         5081        64.00
   19759.103     0.985938         5089        71.11
   19857.407     0.987500         5097        80.00
   19988.479     0.989062         5105        91.43
   20103.167     0.990625         5114       106.67
   20234.239     0.992188         5121       128.00
   20316.159     0.992969         5125       142.22
   20447.231     0.993750         5129       160.00
   20561.919     0.994531         5133       182.86
   20774.911     0.995313         5137       213.33
   20922.367     0.996094         5141       256.00
   21037.055     0.996484         5143       284.44
   21086.207     0.996875         5145       320.00
   21168.127     0.997266         5147       365.71
   21233.663     0.997656         5149       426.67
   21413.887     0.998047         5151       512.00
   21577.727     0.998242         5152       568.89
   21610.495     0.998437         5153       640.00
   21659.647     0.998633         5154       731.43
   21889.023     0.998828         5155       853.33
   21987.327     0.999023         5157      1024.00
   21987.327     0.999121         5157      1137.78
   21987.327     0.999219         5157      1280.00
   22020.095     0.999316         5158      1462.86
   22020.095     0.999414         5158      1706.67
   22052.863     0.999512         5159      2048.00
   22052.863     0.999561         5159      2275.56
   22052.863     0.999609         5159      2560.00
   22364.159     0.999658         5160      2925.71
   22364.159     0.999707         5160      3413.33
   22364.159     0.999756         5160      4096.00
   22364.159     0.999780         5160      4551.11
   22364.159     0.999805         5160      5120.00
   22822.911     0.999829         5161      5851.43
   22822.911     1.000000         5161          inf
#[Mean    =    10968.070, StdDeviation   =     5365.811]
#[Max     =    22806.528, Total count    =         5161]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  5635 requests in 1.00m, 8.19MB read
  Socket errors: connect 0, read 0, write 0, timeout 82
  Non-2xx or 3xx responses: 2060
Requests/sec:     93.83
Transfer/sec:    139.72KB