raw-results/azure/azure-direct-35rps.txt
Running 1m test @ https://sabc-claude-sea.cognitiveservices.azure.com/openai/deployments/gpt-5/chat/completions?api-version=2025-01-01-preview
  4 threads and 35 connections
  Thread calibration: mean lat.: 4480.045ms, rate sampling interval: 12238ms
  Thread calibration: mean lat.: 4408.365ms, rate sampling interval: 12197ms
  Thread calibration: mean lat.: 3957.955ms, rate sampling interval: 11960ms
  Thread calibration: mean lat.: 4196.553ms, rate sampling interval: 11747ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    19.09s     7.13s   33.33s    57.46%
    Req/Sec     4.19      0.53     5.00    100.00%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%   19.69s 
 75.000%   25.33s 
 90.000%   28.20s 
 99.000%   31.69s 
 99.900%   32.95s 
 99.990%   33.34s 
 99.999%   33.34s 
100.000%   33.34s 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

    6377.471     0.000000            1         1.00
    9043.967     0.100000           95         1.11
   11501.567     0.200000          189         1.25
   13737.983     0.300000          284         1.43
   16826.367     0.400000          378         1.67
   19693.567     0.500000          473         2.00
   20971.519     0.550000          520         2.22
   22396.927     0.600000          567         2.50
   23330.815     0.650000          616         2.86
   24313.855     0.700000          662         3.33
   25329.663     0.750000          709         4.00
   25739.263     0.775000          734         4.44
   26263.551     0.800000          756         5.00
   26755.071     0.825000          780         5.71
   27213.823     0.850000          804         6.67
   27705.343     0.875000          828         8.00
   28000.255     0.887500          840         8.89
   28196.863     0.900000          851        10.00
   28557.311     0.912500          863        11.43
   28786.687     0.925000          876        13.33
   29081.599     0.937500          886        16.00
   29294.591     0.943750          892        17.78
   29474.815     0.950000          899        20.00
   29605.887     0.956250          904        22.86
   29704.191     0.962500          910        26.67
   30130.175     0.968750          916        32.00
   30244.863     0.971875          919        35.56
   30490.623     0.975000          922        40.00
   30638.079     0.978125          925        45.71
   31047.679     0.981250          928        53.33
   31145.983     0.984375          931        64.00
   31162.367     0.985938          932        71.11
   31506.431     0.987500          934        80.00
   31604.735     0.989062          935        91.43
   31817.727     0.990625          937       106.67
   31932.415     0.992188          938       128.00
   32047.103     0.992969          939       142.22
   32227.327     0.993750          940       160.00
   32227.327     0.994531          940       182.86
   32505.855     0.995313          941       213.33
   32636.927     0.996094          942       256.00
   32636.927     0.996484          942       284.44
   32915.455     0.996875          943       320.00
   32915.455     0.997266          943       365.71
   32915.455     0.997656          943       426.67
   32948.223     0.998047          944       512.00
   32948.223     0.998242          944       568.89
   32948.223     0.998437          944       640.00
   32948.223     0.998633          944       731.43
   32948.223     0.998828          944       853.33
   33341.439     0.999023          945      1024.00
   33341.439     1.000000          945          inf
#[Mean    =    19090.429, StdDeviation   =     7127.881]
#[Max     =    33325.056, Total count    =          945]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  1081 requests in 1.00m, 1.86MB read
  Socket errors: connect 0, read 0, write 0, timeout 83
Requests/sec:     18.00
Transfer/sec:     31.70KB