raw-results/azure/azure-direct-60rps.txt
Running 1m test @ https://sabc-claude-sea.cognitiveservices.azure.com/openai/deployments/gpt-5/chat/completions?api-version=2025-01-01-preview
  4 threads and 60 connections
  Thread calibration: mean lat.: 2738.169ms, rate sampling interval: 7626ms
  Thread calibration: mean lat.: 3000.809ms, rate sampling interval: 8593ms
  Thread calibration: mean lat.: 3123.717ms, rate sampling interval: 8814ms
  Thread calibration: mean lat.: 2828.950ms, rate sampling interval: 7749ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    13.56s     5.27s   25.76s    59.96%
    Req/Sec     9.05      0.37    10.00    100.00%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%   13.49s 
 75.000%   17.97s 
 90.000%   20.73s 
 99.000%   23.72s 
 99.900%   24.90s 
 99.990%   25.77s 
 99.999%   25.77s 
100.000%   25.77s 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

    4093.951     0.000000            1         1.00
    6578.175     0.100000          191         1.11
    8228.863     0.200000          380         1.25
    9904.127     0.300000          570         1.43
   11534.335     0.400000          760         1.67
   13492.223     0.500000          950         2.00
   14516.223     0.550000         1044         2.22
   15441.919     0.600000         1139         2.50
   16310.271     0.650000         1235         2.86
   17104.895     0.700000         1329         3.33
   17973.247     0.750000         1424         4.00
   18350.079     0.775000         1472         4.44
   18776.063     0.800000         1519         5.00
   19251.199     0.825000         1567         5.71
   19677.183     0.850000         1615         6.67
   20267.007     0.875000         1663         8.00
   20479.999     0.887500         1685         8.89
   20725.759     0.900000         1710        10.00
   20971.519     0.912500         1732        11.43
   21299.199     0.925000         1756        13.33
   21676.031     0.937500         1780        16.00
   21872.639     0.943750         1792        17.78
   21987.327     0.950000         1806        20.00
   22200.319     0.956250         1815        22.86
   22331.391     0.962500         1827        26.67
   22642.687     0.968750         1840        32.00
   22773.759     0.971875         1845        35.56
   22839.295     0.975000         1851        40.00
   22937.599     0.978125         1859        45.71
   23035.903     0.981250         1863        53.33
   23248.895     0.984375         1869        64.00
   23396.351     0.985938         1873        71.11
   23543.807     0.987500         1876        80.00
   23707.647     0.989062         1878        91.43
   23740.415     0.990625         1881       106.67
   23805.951     0.992188         1884       128.00
   23838.719     0.992969         1885       142.22
   23937.023     0.993750         1887       160.00
   24035.327     0.994531         1888       182.86
   24150.015     0.995313         1890       213.33
   24231.935     0.996094         1891       256.00
   24330.239     0.996484         1892       284.44
   24379.391     0.996875         1893       320.00
   24379.391     0.997266         1893       365.71
   24461.311     0.997656         1894       426.67
   24494.079     0.998047         1895       512.00
   24494.079     0.998242         1895       568.89
   24903.679     0.998437         1896       640.00
   24903.679     0.998633         1896       731.43
   24903.679     0.998828         1896       853.33
   25165.823     0.999023         1897      1024.00
   25165.823     0.999121         1897      1137.78
   25165.823     0.999219         1897      1280.00
   25165.823     0.999316         1897      1462.86
   25165.823     0.999414         1897      1706.67
   25772.031     0.999512         1898      2048.00
   25772.031     1.000000         1898          inf
#[Mean    =    13558.296, StdDeviation   =     5272.157]
#[Max     =    25755.648, Total count    =         1898]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  2234 requests in 1.00m, 3.85MB read
  Socket errors: connect 0, read 0, write 0, timeout 35
Requests/sec:     37.18
Transfer/sec:     65.54KB